# Pandas Practice

In [3]:
import pandas as pd
import numpy as np
import math

C:\Users\manis\AppData\Local\Temp\ipykernel_18100\2456975822.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

# Question 1

In [4]:
df = [
    ["Alice", 80, 90],
    ["Bob", 70, 85],
    ["Charlie", 90, 95]
]
df = pd.DataFrame(df, columns=['Name', 'math', 'science'])

In [5]:
df

      Name  math  science
0    Alice    80       90
1      Bob    70       85
2  Charlie    90       95

In [6]:
df['total_score'] = df['math'] + df['science']

In [7]:
df

      Name  math  science  total_score
0    Alice    80       90          170
1      Bob    70       85          155
2  Charlie    90       95          185

# Question 2

In [8]:
df = [
    ["John", 50000],
    ["Mary", 70000],
    ["Sam", 40000],
    ["Anna", 90000]
]
df = pd.DataFrame(df, columns=['Name', 'Salary'])

In [9]:
df

   Name  Salary
0  John   50000
1  Mary   70000
2   Sam   40000
3  Anna   90000

In [10]:
t = 60000

In [11]:
df = df[df['Salary'] > t]

In [12]:
df

   Name  Salary
1  Mary   70000
3  Anna   90000

# Question 3

In [13]:
df = [
    ["IT", 60000],
    ["HR", 40000],
    ["IT", 70000],
    ["Finance", 50000],
    ["HR", 45000],
    ["Finance", 55000]
]
df = pd.DataFrame(df, columns=['dept', 'salary'])

In [14]:
df

      dept  salary
0       IT   60000
1       HR   40000
2       IT   70000
3  Finance   50000
4       HR   45000
5  Finance   55000

In [16]:
res = df.groupby('dept', as_index=False)['salary'].mean()

In [17]:
res

      dept   salary
0  Finance  52500.0
1       HR  42500.0
2       IT  65000.0

# Question 4

In [18]:
df = [
    ["Laptop", 70000],
    ["Phone", 30000],
    ["Tablet", 20000],
    ["Monitor", 15000]
]
df = pd.DataFrame(df, columns=['item', 'price'])

In [19]:
df

      item  price
0   Laptop  70000
1    Phone  30000
2   Tablet  20000
3  Monitor  15000

In [21]:
df = df.sort_values(by='price', ascending=False).reset_index(drop=True)

In [23]:
df

      item  price
0   Laptop  70000
1    Phone  30000
2   Tablet  20000
3  Monitor  15000

# Question 5

In [26]:
df = [
    [101, "John"],
    [102, "Mary"],
    [103, "Sam"]
]
df = pd.DataFrame(df, columns=['id', 'name'])

In [27]:
df

    id  name
0  101  John
1  102  Mary
2  103   Sam

In [28]:
df1 = [
    [101, 50000],
    [102, 70000],
    [103, 40000]
]
df1 = pd.DataFrame(df1, columns=['id', 'salary'])

In [29]:
df1

    id  salary
0  101   50000
1  102   70000
2  103   40000

In [31]:
df = pd.merge(df1, df, on='id')

In [32]:
df

    id  salary  name
0  101   50000  John
1  102   70000  Mary
2  103   40000   Sam

# Question 6

In [40]:
df = [
    ["IT", "M", 60000],
    ["HR", "F", 40000],
    ["IT", "F", 70000],
    ["Finance", "M", 50000],
    ["HR", "M", 45000],
    ["Finance", "F", 55000]
]
df = pd.DataFrame(df, columns=['dept', 'gender', 'salary'])

In [41]:
df

      dept gender  salary
0       IT      M   60000
1       HR      F   40000
2       IT      F   70000
3  Finance      M   50000
4       HR      M   45000
5  Finance      F   55000

In [42]:
df = df.groupby(['dept', 'gender'], as_index=False)['salary'].mean()

In [43]:
df

      dept gender   salary
0  Finance      F  55000.0
1  Finance      M  50000.0
2       HR      F  40000.0
3       HR      M  45000.0
4       IT      F  70000.0
5       IT      M  60000.0

# Question 7

In [44]:
df = [
    ["North", "Laptop", 200],
    ["South", "Laptop", 300],
    ["North", "Phone", 150],
    ["South", "Phone", 250],
    ["East", "Laptop", 100],
    ["East", "Phone", 120],
    ["West", "Phone", 180]
]
df = pd.DataFrame(df, columns=['dir', 'item', 'stock'])

In [45]:
df

     dir    item  stock
0  North  Laptop    200
1  South  Laptop    300
2  North   Phone    150
3  South   Phone    250
4   East  Laptop    100
5   East   Phone    120
6   West   Phone    180